# Introduction

This is a SQL demo. I will use [pandasql library](https://pypi.org/project/pandasql/) for use sql in pandas.

So, step one is import or install this library

In [ ]:
import pip
def import_or_install(package):
    try:
        __import__(package)
    except ImportError:
        pip.main(['install', package])       
import_or_install("pandasql")

In [1]:
from pandasql import PandaSQL
pdsql = PandaSQL()

Ok, now we need data. We will use one Seaborn dataset, from Titanic survivors.

In [2]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

Ok, 'head()' function show the first 5 rows (by default), so let doing the same, but with sql query:

In [3]:
pdsql("SELECT * FROM titanic LIMIT 5;")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,1,None,Southampton,no,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,0,C,Cherbourg,yes,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,0,None,Southampton,yes,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,0,C,Southampton,yes,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,1,None,Southampton,no,1

We can, of course, select some condition:

In [4]:
pdsql("SELECT * FROM titanic WHERE sex='female' LIMIT 5;")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,1,1,female,38.0,1,0,71.2833,C,First,woman,0,C,Cherbourg,yes,0
1,1,3,female,26.0,0,0,7.9250,S,Third,woman,0,None,Southampton,yes,1
2,1,1,female,35.0,1,0,53.1000,S,First,woman,0,C,Southampton,yes,0
3,1,3,female,27.0,0,2,11.1333,S,Third,woman,0,None,Southampton,yes,0
4,1,2,female,14.0,1,0,30.0708,C,Second,child,0,None,Cherbourg,yes,0

Given that pdsql return a dataframe, we can use other dataframe functions over it. For simple example, call head with just 2 rows:

In [5]:
pdsql("SELECT * FROM titanic WHERE sex='female' LIMIT 5;").head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,1,1,female,38.0,1,0,71.2833,C,First,woman,0,C,Cherbourg,yes,0
1,1,3,female,26.0,0,0,7.9250,S,Third,woman,0,None,Southampton,yes,1

... or tail from the first 5 rows:

In [6]:
pdsql("SELECT * FROM titanic WHERE sex='female' LIMIT 5;").tail(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
3,1,3,female,27.0,0,2,11.1333,S,Third,woman,0,None,Southampton,yes,0
4,1,2,female,14.0,1,0,30.0708,C,Second,child,0,None,Cherbourg,yes,0

## Agregate queries

Let explore how many people

In [7]:
query = """
SELECT count(*) AS count, class, sex, who, survived, count(survived) as count_survived
FROM titanic
GROUP BY class, sex, who, survived
ORDER BY class, sex, who DESC
"""
pdsql(query)

    count   class     sex    who  survived  count_survived
0       2   First  female  woman         0               2
1      89   First  female  woman         1              89
2       1   First  female  child         0               1
3       2   First  female  child         1               2
4      77   First    male    man         0              77
5      42   First    male    man         1              42
6       3   First    male  child         1               3
7       6  Second  female  woman         0               6
8      60  Second  female  woman         1              60
9      10  Second  female  child         1              10
10     91  Second    male    man         0              91
11      8  Second    male    man         1               8
12      9  Second    male  child         1               9
13     58   Third  female  woman         0              58
14     56   Third  female  woman         1              56
15     14   Third  female  child         0              14
16     16   Third  female  child         1              16
17    281   Third    male    man         0             281
18     38   Third    male    man         1              38
19     19   Third    male  child         0              19
20      9   Third    male  child         1               9

In [8]:
query = """
SELECT count(*) AS count, class, sex, who, survived, count(survived) as count_survived
FROM titanic
GROUP BY class, sex, who, survived
HAVING (survived)>0
ORDER BY class, sex, who DESC
"""
survived = pdsql(query)
survived

    count   class     sex    who  survived  count_survived
0      89   First  female  woman         1              89
1       2   First  female  child         1               2
2      42   First    male    man         1              42
3       3   First    male  child         1               3
4      60  Second  female  woman         1              60
5      10  Second  female  child         1              10
6       8  Second    male    man         1               8
7       9  Second    male  child         1               9
8      56   Third  female  woman         1              56
9      16   Third  female  child         1              16
10     38   Third    male    man         1              38
11      9   Third    male  child         1               9

Ok, let check if that is correct: we have a dataframe, called 'survived' with agregational data. We can use '<>column.sum()' to sum all element in that column:

In [9]:
survived.count_survived.sum()

342

We can see that it the same with the simple query

In [10]:
query = """
SELECT count(*)
FROM titanic
WHERE (survived)>0
ORDER BY class, sex, who DESC
"""
pdsql(query)

   count(*)
0       342

## Separate classes

In [11]:
query = """
SELECT *
FROM titanic
WHERE class='First'
"""
c1 = pdsql(query)
c1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,1,1,female,38.0,1,0,71.2833,C,First,woman,0,C,Cherbourg,yes,0
1,1,1,female,35.0,1,0,53.1000,S,First,woman,0,C,Southampton,yes,0
2,0,1,male,54.0,0,0,51.8625,S,First,man,1,E,Southampton,no,1
3,1,1,female,58.0,0,0,26.5500,S,First,woman,0,C,Southampton,yes,1
4,1,1,male,28.0,0,0,35.5000,S,First,man,1,A,Southampton,yes,1
5,0,1,male,19.0,3,2,263.0000,S,First,man,1,C,Southampton,no,0
6,0,1,male,40.0,0,0,27.7208,C,First,man,1,None,Cherbourg,no,1
7,1,1,female,NaN,1,0,146.5208,C,First,woman,0,B,Cherbourg,yes,0
8,0,1,male,28.0,1,0,82.1708,C,First,man,1,None,Cherbourg,no,0
9,0,1,male,42.0,1,0,52.0000,S,First,man,1,None,Southampton,no,0
10,1,1,female,49.0,1,0,76.7292,C,First,woman,0,D,Cherbourg,yes,0
11,0,1,male,65.0,0,1,61.9792,C,First,man,1,B,Cherbourg,no,0
12,1,1,male,NaN,0,0,35.5000,S,First,man,1,C,Southampton,yes,1
13,1,1,female,38.0,0,0,80.0000,None,First,woman,0,B,None,yes,1
14,0,1,male,45.0,1,0,83.4750,S,First,man,1,C,Southampton,no,0
15,0,1,male,NaN,0,0,27.7208,C,First,man,1,None,Cherbourg,no,1
16,0,1,male,28.0,0,0,47.1000,S,First,man,1,None,Southampton,no,1
17,1,1,female,23.0,3,2,263.0000,S,First,woman,0,C,Southampton,yes,0
18,0,1,male,46.0,1,0,61.1750,S,First,man,1,E,Southampton,no,0
19,0,1,male,71.0,0,0,34.6542,C,First,man,1,A,Cherbourg,no,1
20,1,1,male,23.0,0,1,63.3583,C,First,man,1,D,Cherbourg,yes,0
21,0,1,male,21.0,0,1,77.2875,S,First,man,1,D,Southampton,no,0
22,0,1,male,47.0,0,0,52.0000,S,First,man,1,C,Southampton,no,1
23,0,1,male,24.0,0,1,247.5208,C,First,man,1,B,Cherbourg,no,0
24,0,1,male,54.0,0,1,77.2875,S,First,man,1,D,Southampton,no,0
25,1,1,female,19.0,0,2,26.2833,S,First,woman,0,D,Southampton,yes,0
26,0,1,male,37.0,1,0,53.1000,S,First,man,1,C,Southampton,no,0
27,0,1,male,24.0,0,0,79.2000,C,First,man,1,B,Cherbourg,no,1
28,1,1,female,22.0,1,0,66.6000,S,First,woman,0,C,Southampton,yes,0
29,0,1,male,51.0,0,1,61.3792,C,First,man,1,None,Cherbourg,no,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
186,1,1,female,36.0,1,2,120.0000,S,First,woman,0,B,Southampton,yes,0
187,1,1,female,51.0,1,0,77.9583,S,First,woman,0,D,Southampton,yes,0
188,0,1,male,NaN,0,0,39.6000,C,First,man,1,None,Cherbourg,no,1
189,1,1,female,43.0,0,1,211.3375,S,First,woman,0,B,Southampton,yes,0
190,1,1,female,17.0,1,0,57.0000,S,First,woman,0,B,Southampton,yes,0
191,0,1,male,29.0,0,0,30.0000,S,First,man,1,D,Southampton,no,1
192,0,1,male,46.0,0,0,79.2000,C,First,man,1,B,Cherbourg,no,1
193,0,1,male,NaN,0,0,30.6958,C,First,man,1,None,Cherbourg,no,1
194,1,1,female,49.0,0,0,25.9292,S,First,woman,0,D,Southampton,yes,1
195,1,1,male,11.0,1,2,120.0000,S,First,child,0,B,Southampton,yes,0
196,0,1,male,39.0,0,0,0.0000,S,First,man,1,A,Southampton,no,1
197,1,1,female,33.0,1,0,53.1000,S,First,woman,0,E,Southampton,yes,0
198,0,1,male,NaN,0,0,0.0000,S,First,man,1,B,Southampton,no,1
199,1,1,female,52.0,1,1,93.5000,S,First,woman,0,B,Southampton,yes,0
200,0,1,male,38.0,0,0,0.0000,S,First,man,1,None,Southampton,no,1
201,1,1,female,62.0,0,0,80.0000,None,First,woman,0,B,None,yes,1
202,1,1,female,39.0,1,1,83.1583,C,First,woman,0,E,Cherbourg,yes,0
203,1,1,male,NaN,0,0,29.7000,C,First,man,1,C,Cherbourg,yes,1
204,1,1,female,30.0,0,0,31.0000,C,First,woman,0,None,Cherbourg,yes,1
205,1,1,female,NaN,1,0,89.1042,C,First,woman,0,C,Cherbourg,yes,0
206,1,1,female,16.0,0,1,39.4000,S,First,woman,0,D,Southampton,yes,0
207,1,1,female,45.0,1,1,164.8667,S,First,woman,0,None,Southampton,yes,0
208,1,1,male,51.0,0,0,26.5500,S,First,man,1,E,Southampton,yes,1
209,1,1,female,48.0,0,0,25.9292,S,First,woman,0,D,Southampton,yes,1
210,0,1,male,31.0,0,0,50.4958,S,First,man,1,A,Southampton,no,1
211,1,1,female,47.0,1,1,52.5542,S,First,woman,0,D,Southampton,yes,0
212,0,1,male,33.0,0,0,5.0000,S,First,man,1,B,Southampton,no,1
213,1,1,female,56.0,0,1,83.1583,C,First,woman,0,C,Cherbourg,yes,0
214,1,1,female,19.0,0,0,30.0000,S,First,woman,0,B,Southampton,yes,1
215,1,1,male,26.0,0,0,30.0000,C,First,man,1,C,Cherbourg,yes,1

In [12]:
query = """
SELECT *
FROM titanic
WHERE class='Second'
"""
c2 = pdsql(query)
c2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,1,2,female,14.00,1,0,30.0708,C,Second,child,0,None,Cherbourg,yes,0
1,1,2,female,55.00,0,0,16.0000,S,Second,woman,0,None,Southampton,yes,1
2,1,2,male,NaN,0,0,13.0000,S,Second,man,1,None,Southampton,yes,1
3,0,2,male,35.00,0,0,26.0000,S,Second,man,1,None,Southampton,no,1
4,1,2,male,34.00,0,0,13.0000,S,Second,man,1,D,Southampton,yes,1
5,0,2,male,66.00,0,0,10.5000,S,Second,man,1,None,Southampton,no,1
6,0,2,female,27.00,1,0,21.0000,S,Second,woman,0,None,Southampton,no,0
7,1,2,female,3.00,1,2,41.5792,C,Second,child,0,None,Cherbourg,yes,0
8,1,2,female,29.00,1,0,26.0000,S,Second,woman,0,None,Southampton,yes,0
9,1,2,female,21.00,0,0,10.5000,S,Second,woman,0,None,Southampton,yes,1
10,1,2,female,5.00,1,2,27.7500,S,Second,child,0,None,Southampton,yes,0
11,1,2,female,29.00,0,0,10.5000,S,Second,woman,0,F,Southampton,yes,1
12,0,2,male,32.00,0,0,10.5000,S,Second,man,1,None,Southampton,no,1
13,0,2,male,21.00,0,0,73.5000,S,Second,man,1,None,Southampton,no,1
14,1,2,male,0.83,0,2,29.0000,S,Second,child,0,None,Southampton,yes,0
15,1,2,female,17.00,0,0,10.5000,S,Second,woman,0,None,Southampton,yes,1
16,1,2,female,34.00,0,1,23.0000,S,Second,woman,0,None,Southampton,yes,0
17,0,2,male,34.00,1,0,26.0000,S,Second,man,1,None,Southampton,no,0
18,0,2,male,29.00,1,0,21.0000,S,Second,man,1,None,Southampton,no,0
19,0,2,male,21.00,2,0,73.5000,S,Second,man,1,None,Southampton,no,0
20,0,2,male,32.50,1,0,30.0708,C,Second,man,1,None,Cherbourg,no,0
21,1,2,female,32.50,0,0,13.0000,S,Second,woman,0,E,Southampton,yes,1
22,1,2,female,29.00,1,0,26.0000,S,Second,woman,0,None,Southampton,yes,0
23,0,2,male,25.00,0,0,13.0000,S,Second,man,1,None,Southampton,no,1
24,0,2,male,23.00,0,0,15.0458,C,Second,man,1,None,Cherbourg,no,1
25,0,2,male,18.00,0,0,11.5000,S,Second,man,1,None,Southampton,no,1
26,0,2,male,19.00,1,1,36.7500,S,Second,man,1,None,Southampton,no,0
27,0,2,male,36.50,0,2,26.0000,S,Second,man,1,F,Southampton,no,0
28,0,2,male,42.00,0,0,13.0000,S,Second,man,1,None,Southampton,no,1
29,0,2,male,51.00,0,0,12.5250,S,Second,man,1,None,Southampton,no,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
154,0,2,male,NaN,0,0,0.0000,S,Second,man,1,None,Southampton,no,1
155,0,2,male,23.00,0,0,13.0000,S,Second,man,1,None,Southampton,no,1
156,0,2,male,23.00,0,0,13.0000,S,Second,man,1,None,Southampton,no,1
157,1,2,female,30.00,0,0,13.0000,S,Second,woman,0,None,Southampton,yes,1
158,1,2,female,4.00,1,1,23.0000,S,Second,child,0,None,Southampton,yes,0
159,1,2,female,48.00,1,2,65.0000,S,Second,woman,0,None,Southampton,yes,0
160,1,2,male,0.67,1,1,14.5000,S,Second,child,0,None,Southampton,yes,0
161,0,2,male,18.00,0,0,11.5000,S,Second,man,1,None,Southampton,no,1
162,0,2,female,57.00,0,0,10.5000,S,Second,woman,0,E,Southampton,no,1
163,1,2,female,54.00,1,3,23.0000,S,Second,woman,0,None,Southampton,yes,0
164,0,2,male,16.00,0,0,26.0000,S,Second,man,1,None,Southampton,no,1
165,0,2,male,39.00,0,0,13.0000,S,Second,man,1,None,Southampton,no,1
166,0,2,male,34.00,0,0,13.0000,S,Second,man,1,None,Southampton,no,1
167,1,2,female,31.00,1,1,26.2500,S,Second,woman,0,None,Southampton,yes,0
168,0,2,male,39.00,0,0,13.0000,S,Second,man,1,None,Southampton,no,1
169,0,2,male,35.00,0,0,10.5000,S,Second,man,1,None,Southampton,no,1
170,0,2,male,31.00,1,1,37.0042,C,Second,man,1,None,Cherbourg,no,0
171,1,2,male,1.00,0,2,37.0042,C,Second,child,0,None,Cherbourg,yes,0
172,1,2,male,0.83,1,1,18.7500,S,Second,child,0,None,Southampton,yes,0
173,0,2,male,16.00,0,0,10.5000,S,Second,man,1,None,Southampton,no,1
174,0,2,male,28.00,0,1,33.0000,S,Second,man,1,None,Southampton,no,0
175,0,2,female,44.00,1,0,26.0000,S,Second,woman,0,None,Southampton,no,0
176,0,2,male,21.00,1,0,11.5000,S,Second,man,1,None,Southampton,no,0
177,0,2,male,24.00,0,0,13.0000,S,Second,man,1,None,Southampton,no,1
178,1,2,female,42.00,0,0,13.0000,S,Second,woman,0,None,Southampton,yes,1
179,1,2,female,27.00,1,0,13.8583,C,Second,woman,0,None,Cherbourg,yes,0
180,1,2,female,28.00,1,0,24.0000,C,Second,woman,0,None,Cherbourg,yes,0
181,1,2,female,25.00,0,1,26.0000,S,Second,woman,0,None,Southampton,yes,0
182,0,2,male,28.00,0,0,10.5000,S,Second,man,1,None,Southampton,no,1
183,0,2,male,27.00,0,0,13.0000,S,Second,man,1,None,Southampton,no,1

In [13]:
query = """
SELECT *
FROM titanic
WHERE class='Third'
"""
c3 = pdsql(query)
c3

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,1,None,Southampton,no,0
1,1,3,female,26.0,0,0,7.9250,S,Third,woman,0,None,Southampton,yes,1
2,0,3,male,35.0,0,0,8.0500,S,Third,man,1,None,Southampton,no,1
3,0,3,male,NaN,0,0,8.4583,Q,Third,man,1,None,Queenstown,no,1
4,0,3,male,2.0,3,1,21.0750,S,Third,child,0,None,Southampton,no,0
5,1,3,female,27.0,0,2,11.1333,S,Third,woman,0,None,Southampton,yes,0
6,1,3,female,4.0,1,1,16.7000,S,Third,child,0,G,Southampton,yes,0
7,0,3,male,20.0,0,0,8.0500,S,Third,man,1,None,Southampton,no,1
8,0,3,male,39.0,1,5,31.2750,S,Third,man,1,None,Southampton,no,0
9,0,3,female,14.0,0,0,7.8542,S,Third,child,0,None,Southampton,no,1
10,0,3,male,2.0,4,1,29.1250,Q,Third,child,0,None,Queenstown,no,0
11,0,3,female,31.0,1,0,18.0000,S,Third,woman,0,None,Southampton,no,0
12,1,3,female,NaN,0,0,7.2250,C,Third,woman,0,None,Cherbourg,yes,1
13,1,3,female,15.0,0,0,8.0292,Q,Third,child,0,None,Queenstown,yes,1
14,0,3,female,8.0,3,1,21.0750,S,Third,child,0,None,Southampton,no,0
15,1,3,female,38.0,1,5,31.3875,S,Third,woman,0,None,Southampton,yes,0
16,0,3,male,NaN,0,0,7.2250,C,Third,man,1,None,Cherbourg,no,1
17,1,3,female,NaN,0,0,7.8792,Q,Third,woman,0,None,Queenstown,yes,1
18,0,3,male,NaN,0,0,7.8958,S,Third,man,1,None,Southampton,no,1
19,1,3,female,NaN,0,0,7.7500,Q,Third,woman,0,None,Queenstown,yes,1
20,1,3,male,NaN,0,0,7.2292,C,Third,man,1,None,Cherbourg,yes,1
21,0,3,male,21.0,0,0,8.0500,S,Third,man,1,None,Southampton,no,1
22,0,3,female,18.0,2,0,18.0000,S,Third,woman,0,None,Southampton,no,0
23,1,3,female,14.0,1,0,11.2417,C,Third,child,0,None,Cherbourg,yes,0
24,0,3,female,40.0,1,0,9.4750,S,Third,woman,0,None,Southampton,no,0
25,0,3,male,NaN,0,0,7.8958,C,Third,man,1,None,Cherbourg,no,1
26,1,3,female,19.0,0,0,7.8792,Q,Third,woman,0,None,Queenstown,yes,1
27,0,3,male,NaN,0,0,8.0500,S,Third,man,1,None,Southampton,no,1
28,0,3,male,NaN,1,0,15.5000,Q,Third,man,1,None,Queenstown,no,0
29,1,3,female,NaN,0,0,7.7500,Q,Third,woman,0,None,Queenstown,yes,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
461,0,3,male,NaN,0,0,8.0500,S,Third,man,1,None,Southampton,no,1
462,1,3,male,32.0,0,0,56.4958,S,Third,man,1,None,Southampton,yes,1
463,0,3,male,20.0,0,0,7.9250,S,Third,man,1,None,Southampton,no,1
464,0,3,male,34.5,0,0,6.4375,C,Third,man,1,None,Cherbourg,no,1
465,0,3,male,17.0,0,0,8.6625,S,Third,man,1,None,Southampton,no,1
466,0,3,male,42.0,0,0,7.5500,S,Third,man,1,None,Southampton,no,1
467,0,3,male,NaN,8,2,69.5500,S,Third,man,1,None,Southampton,no,0
468,0,3,male,35.0,0,0,7.8958,C,Third,man,1,None,Cherbourg,no,1
469,0,3,male,4.0,4,2,31.2750,S,Third,child,0,None,Southampton,no,0
470,0,3,male,74.0,0,0,7.7750,S,Third,man,1,None,Southampton,no,1
471,0,3,female,9.0,1,1,15.2458,C,Third,child,0,None,Cherbourg,no,0
472,1,3,female,18.0,0,1,9.3500,S,Third,woman,0,None,Southampton,yes,0
473,1,3,female,24.0,0,3,19.2583,C,Third,woman,0,None,Cherbourg,yes,0
474,0,3,male,NaN,0,0,7.2292,C,Third,man,1,None,Cherbourg,no,1
475,0,3,male,41.0,2,0,14.1083,S,Third,man,1,None,Southampton,no,0
476,0,3,female,NaN,8,2,69.5500,S,Third,woman,0,None,Southampton,no,0
477,0,3,male,NaN,0,0,9.5000,S,Third,man,1,None,Southampton,no,1
478,1,3,male,4.0,1,1,11.1333,S,Third,child,0,None,Southampton,yes,0
479,0,3,male,26.0,0,0,7.8958,S,Third,man,1,None,Southampton,no,1
480,0,3,male,47.0,0,0,9.0000,S,Third,man,1,None,Southampton,no,1
481,1,3,female,15.0,0,0,7.2250,C,Third,child,0,None,Cherbourg,yes,1
482,0,3,male,20.0,0,0,9.8458,S,Third,man,1,None,Southampton,no,1
483,0,3,male,19.0,0,0,7.8958,S,Third,man,1,None,Southampton,no,1
484,0,3,male,NaN,0,0,7.8958,S,Third,man,1,None,Southampton,no,1
485,0,3,male,33.0,0,0,7.8958,S,Third,man,1,None,Southampton,no,1
486,0,3,female,22.0,0,0,10.5167,S,Third,woman,0,None,Southampton,no,1
487,0,3,male,25.0,0,0,7.0500,S,Third,man,1,None,Southampton,no,1
488,0,3,female,39.0,0,5,29.1250,Q,Third,woman,0,None,Queenstown,no,0
489,0,3,female,NaN,1,2,23.4500,S,Third,woman,0,None,Southampton,no,0
490,0,3,male,32.0,0,0,7.7500,Q,Third,man,1,None,Queenstown,no,1

### There is some 'embark_town' common in c1 and c2?

In [14]:
query = """
SELECT DISTINCT c1.embark_town
FROM c1, c2
WHERE c1.embark_town = c2.embark_town
--LIMIT 2
"""
pdsql(query)

   embark_town
0    Cherbourg
1  Southampton
2   Queenstown

### There is some 'embark_town' common in c1, c2 and c3?

In [15]:
query = """
SELECT DISTINCT c1.embark_town
FROM c1, c2, c3
WHERE 
c1.embark_town = c2.embark_town and
c2.embark_town = c3.embark_town 
--LIMIT 2
"""
pdsql(query)

   embark_town
0    Cherbourg
1  Southampton
2   Queenstown

Just for check, let see the shared from c1 and c3...

In [17]:
query = """
SELECT DISTINCT c1.embark_town
FROM c1, c3
WHERE c1.embark_town = c3.embark_town
"""
pdsql(query)

   embark_town
0    Cherbourg
1  Southampton
2   Queenstown

Yes, the 3 classes have 'embark_town' in Cherbourg, Southampton and Queenstown.

# [See the interactive version](https://nbviewer.jupyter.org/github/NeoRichard/DemoSQL/blob/master/DemoSQL1.ipynb)